#!/usr/bin/env python3

# приветствие 
# действие выход или прерывание

# действие ввод названия  тренировки
#name='Тренировка для рук'

# действие ввод параметров, разделитель символ равенства
#repeats=3 повторы
#pause=10s пауза между упражнениями
#relax=30s пацза между подходами
#on_end=40s пауза по окончании тренировки

# действие ввод упражнения и времени
# строка не пуста, разделитель, модифткатор времени
#Подъем хватом молот->30s

# В конце запись в файл с расширением *.sprt


# Переписать screen.pm в виде функций очистки, вывода заголовка, вывода меню
# Тоже самое написать на питоне
