# Заминка

# Здесь должен будет идти блок с параметрами
name:'Заминка'
pause:0.25m
repeats:1
relax:30s
on_end:1m

Поза ребенка->30
Кобра:30s
Бабочка->30
Раст. П. ягодицы лежа->30
Раст. Л. ягодицы лежа->30
Свободное сгибание стоя:30

Выпад назад П. ноги->0.5m
Выпад назад Л. ноги->30
Раст. П. квадрицепса стоя->30
Раст. Л. квадрицепса стоя->30
Свободные подергивания ногами:40

Раст. П. грудных мышц о стену->30
Раст. Л. грудных мышц о стену->30
Раст. П. плеча крестом->30
Раст. Л. плеча крестом->30
Раст. П. трицепса через голову->30
Раст. Л. трицепса через голову->30
Свободные подергивания руками:30
